testFiles/cases/Projectile/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (-514.0 0.0 -9.0);

boundaryField
{

    wall
    {
        type        boundaryCorrectedFixedValue;
        value       uniform (0 0 0);
    }

    open
    {
        type        characteristicFarfieldVelocity;
        U           ( -514.0 0.0 -9.0 );
        p           101300.0;
        T           293.1;
        value       $internalField;
    }

    defaultFaces
    {
        type        slip;
        value       $internalField;
    }

}

// ************************************************************************* //
