testFiles/cases/Projectile/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101300.0;

boundaryField
{

    wall
    {
        type        characteristicWallPressure;
        value       $internalField;
    }

    open
    {
        type        characteristicFarfieldPressure;
        U           ( -514.0 0.0 -9.0 );
        p           101300.0;
        T           293.1;
        value       $internalField;
    }

    defaultFaces
    {
        type        characteristicWallPressure;
        value       $internalField;
    }

}

// ************************************************************************* //
